In [2]:
import pandas as pd
movie_to_genres = pd.read_csv('C:/Users/nswat/Documents/DataCamp/Datasets/4JoiningDataWPandasDatasets/tmdb_movie_to_genres.csv')

m = movie_to_genres['genres'] == 'Romance'
tv_genre = movie_to_genres[m]
tv_genre

       movie_id   genres
925      261375  Romance
1154     341747  Romance
3292      53214  Romance
3884     105885  Romance
4913     153133  Romance
4922     143224  Romance
5542     112949  Romance
6021      97732  Romance
10017     17993  Romance